<?php 
// Изчисляване на 10-та цифра от ЕГН, по зададени първите 9.
// Метод: 
// 1. Задаваме променливи за всяка позиция;
// 2. (sum_possitions)Умножаваме всяка променлива по съответното и тегло; Събираме пробменливите;
// 3. (divide_by_11) Сбора делим на 11;
// 4. (multipl_11) Резултата умножаваме по 11;
// 5. (result_is) От резултата от сбора (sum_possitions) вадим (multipl_11). 


$p1 = 8;
$p2 = 9;
$p3 = 0;
$p4 = 2;
$p5 = 2;
$p6 = 4;
$p7 = 1;
$p8 = 9;
$p9 = 4;

$sum_possitions = ($p1*2)+($p2*4)+($p3*8)+($p4*5)+($p5*10)+($p6*9)+($p7*7)+($p8*3)+($p9*6);
	$divide_by_11 = $sum_possitions / 11;
		$multipl_11 = $divide_by_11 * 11;
			$result_is = $sum_possitions - $multipl_11;

echo "Your EGN is: " . $p1 . $p2 . $p3 . $p4 . $p5 . $p6 . $p7 . $p8 . $p9 . $result_is;