<?php
// РЕШЕНИЕ С if, elseif

// Подрежда 3 числа в нарастващ ред;
// 1. Въвеждаме 3 променливи (а, в, с);
// 2. Пермутацията на 3 елемента = 6 (1.2.3 = 6) // Пермутации от N–елемента се наричат такива съединения, 
//		във всяко от които влизат всички дадени елементи и се различават само по реда на елементите.
// 3. Описваме пермутациите:
// 		abc ==> a < b < c;
//	    acb	==> a < c < b;
// 		bac ==> b < a < c;
// 		cab ==> c < a < b;
// 		bca ==> b < c < a;
// 		cba ==> c < b < a;


$a = 1;
$b = 2;
$c = 3;

if (($a <= $b) && ($b <= $c)){
	echo $a . "," . $b . "," . $c;
} elseif (($a <= $c) && ($c <= $b)){
		echo $a . "," . $c . "," . $b;
}    elseif (($b <= $a) && ($a <= $c)){
		echo $b . "," . $a . "," . $c;
}     elseif (($c <= $a) && ($a <= $b)){
		echo $c . "," . $a . "," . $b;
}      elseif (($b <= $a) && ($a <= $c)){
		echo $b . "," . $a . "," . $c;
} else { echo $c . "," . $b . "," . $a;
}	

?>