<?php
// Проверява дали произведението от 2 числа е четно или нечетно.
//ВАРИАНТ 1.
$a = 2;
$b = 2;

$c = $a * $b;
if ($c != 0) {
	if ($c % 2 == 0) {
		echo "Произведението е четно = " . $c;
	} if ($c % 2 != 0) {
		echo "Произведението е нечетно = " . $c;
	}} 
else {
		echo "Невалидна стойност";
	}

////////////////////////////////////////////
// ВАРИАНТ 2.
echo "<br>";

switch ($c) {
	case 0:
		echo "Невалидна стойност";
		break;
	case ($c % 2 == 0) :
		echo "Произведението е четно число = " . $c;
		break;
	case ($c % 2 !== 0):
		echo "Произведението е нечетно число = " . $c;
		break;
}