<?php
/* Програма, която определя и отпечатва корените на квадратно уравнвние;
Дискриминанта:
D = b^2 - 4ac
Ако D < 0, квадратното уравнение няма реални корени;
Ако D = 0, уравнението има 1 реален корен х = - b/2a;
Ако D > 0, квадратното уравнение има 2 реални корена

x1 = (-b - koren ot D) / 2*a;
x2 = (-b + koren ot D) / 2*a;


Пример: x^2 - 4 = 0
(x - 2)(x + 2)
x = 2;
x =-2;

Пример: 3x^2 + 4x + 5 = 0
D = 4^2 - 4*3*5 = 16 - 60 = -44;
D < 0; => Квадратното уравнение няма релни решения;

Пример: x^2 + 4x - 5 = 0;
D = 16 - 4*1*(-5);
D = 16 + 20;
D = 36

D > 0; => Уравнението има 2 решения;
x1 = (-4 - koren 36) / 2 => 1
x2 = (-4 + koren 36) / 2 => -2
*/

//Уравнението тук:__________________
// Променливите се записват по

$a = 1;
$b = -4;
$c = " ";    /*В кавичките трябва да има празно пространство иначе отива на последния елсе. 
                Със и без празно пространство в браузара излиза следната грешка: Warning: A non-numeric value encountered in C:\xampp\htdocs\HW5_PHP\HW5_Zad9.php on line 39*/
$bp = $b*(-1);
$d = $b*$b - 4*$a*$c;

if ($c = " " && $b < 0) {
	   echo "x = " . (-1 * sqrt($bp));
        echo "<br>";
        echo "x = " .  sqrt($bp);;
	   echo "<br>"; 
}    elseif ($c = " " && $b > 0 ) {
        echo "x = " . sqrt($b);        
} else {
    if($d < 0) {
        echo "The equation has no real solutions!";
    } elseif($d == 0) {
        echo "x = ";
        echo (-$b / 2*$a);
    } else  {
        echo "x1 = ";
        echo ((-$b + sqrt($d)) / (2*$a));
        echo "<br>";
        echo "x2 = ";
        echo ((-$b - sqrt($d)) / (2*$a));
    }}